{
  "success": [
    "Ninja-tastic! You've mastered this question!",
    "Wow! You're as sharp as a shuriken!",
    "You're on fire! Keep up the ninja skills!",
    "Excellent work, young grasshopper!",
    "You're slicing through these questions like a true ninja!",
    "Incredible! You're climbing the ranks of math ninjas!",
    "Sensei would be proud of your progress!",
    "You're as quick and accurate as a ninja star!",
    "Amazing! You're becoming a math master!",
    "Keep it up! You're on the path to becoming a grandmaster!",
    "Ninja-rific! Your math skills are unstoppable!",
    "You're as stealthy with numbers as a ninja in the night!",
    "Fantastic! You're solving problems faster than a ninja's reflexes!",
    "Bravo! You're as precise as a ninja's sword strike!",
    "Awesome job! You're as focused as a ninja in meditation!",
    "Superb! Your math skills are as sharp as a katana!",
    "You're on a roll! Nothing can stop this math ninja!",
    "Brilliant! You're as clever as a ninja's disguise!",
    "Outstanding! You're mastering math like a true ninja warrior!",
    "Phenomenal! Your skills are as impressive as a ninja's acrobatics!",
    "You're unstoppable! Math challenges tremble before you!",
    "Spectacular! You're as agile with numbers as a ninja on a rooftop!",
    "Marvelous! Your problem-solving skills are ninja-level!",
    "Terrific! You're as swift with calculations as a ninja's strike!",
    "Impressive! You're conquering math like a ninja conquers obstacles!",
    "Excellent! Your math prowess is as legendary as the greatest ninjas!",
    "Remarkable! You're as adaptable to new problems as a ninja in any terrain!",
    "Stupendous! Your math skills are as silent but deadly as a ninja's approach!",
    "Fantastic work! You're as unstoppable as a ninja on a mission!",
    "Incredible! Your math abilities are as diverse as a ninja's weapon collection!",
    "Amazing job! You're as prepared for math as a ninja is for battle!",
    "Stellar performance! You're as cool under pressure as a ninja in disguise!",
    "Magnificent! Your problem-solving is as smooth as a ninja's movements!",
    "Brilliant work! You're as resourceful with numbers as a ninja with tools!",
    "Awesome! Your math skills are as honed as a ninja's senses!",
    "Superb job! You're as quick with answers as a ninja's reflexes!",
    "Excellent! Your math prowess is as impressive as a ninja's stealth!",
    "Fantastic! You're as focused on solving as a ninja on a secret mission!",
    "Remarkable! Your calculations are as precise as a ninja's aim!",
    "Outstanding! You're as determined in math as a ninja in training!",
    "Phenomenal work! You're as adaptable to new concepts as a ninja to new terrain!",
    "Incredible job! Your math skills are as sharp as a ninja's throwing stars!",
    "Marvelous! You're as quick with numbers as a ninja's swift movements!",
    "Terrific performance! You're as skilled in math as a ninja in combat!",
    "Spectacular! Your problem-solving is as impressive as a ninja's acrobatics!",
    "Brilliant! You're as prepared for math challenges as a ninja for any mission!",
    "Amazing work! Your math abilities are as diverse as a ninja's skill set!",
    "Stellar job! You're as cool with calculations as a ninja under pressure!",
    "Magnificent performance! You're as agile with numbers as a ninja in action!",
    "Awesome work! Your math skills are as refined as a ninja's techniques!",
    "Superb! You're as focused on accuracy as a ninja on a target!",
    "Excellent job! Your math prowess is as impressive as a ninja's stealth tactics!",
    "Fantastic performance! You're as quick with solutions as a ninja's strikes!",
    "Remarkable work! Your calculations are as precise as a ninja's movements!",
    "Outstanding job! You're as determined in problem-solving as a ninja in training!",
    "Phenomenal! Your adaptability to new math concepts is ninja-level!",
    "Incredible performance! Your math skills are as sharp as a ninja's katana!",
    "Marvelous work! You're as swift with numbers as a ninja's reflexes!",
    "Terrific job! You're as skilled in arithmetic as a ninja in martial arts!",
    "Spectacular performance! Your problem-solving is as impressive as a ninja's disguise!",
    "Brilliant work! You're as prepared for math challenges as a ninja for battle!",
    "Amazing job! Your math abilities are as versatile as a ninja's techniques!",
    "Stellar performance! You're as composed with calculations as a ninja on a mission!",
    "Magnificent work! You're as agile with problem-solving as a ninja in combat!",
    "Awesome job! Your math skills are as polished as a ninja's weapons!",
    "Superb performance! You're as focused on solutions as a ninja on their target!",
    "Excellent work! Your math prowess is as impressive as a ninja's legendary skills!",
    "Fantastic job! You're as quick with answers as a ninja's lightning-fast moves!",
    "Remarkable performance! Your calculations are as accurate as a ninja's aim!",
    "Outstanding work! You're as persistent in math as a ninja in their training!",
    "Phenomenal job! Your grasp of new math concepts is as firm as a ninja's grip!",
    "Incredible work! Your math skills are as formidable as a ninja's reputation!",
    "Marvelous performance! You're as efficient with numbers as a ninja on a mission!",
    "Terrific work! You're as adept in arithmetic as a ninja in stealth!",
    "Spectacular job! Your problem-solving is as impressive as a ninja's strategy!",
    "Brilliant performance! You're as ready for math challenges as a ninja for action!",
    "Amazing work! Your math abilities are as well-rounded as a ninja's training!",
    "Stellar job! You're as unflappable with calculations as a ninja in danger!",
    "Magnificent performance! You're as nimble with problem-solving as a ninja in pursuit!",
    "Awesome work! Your math skills are as respected as a ninja master's wisdom!",
    "Superb job! You're as centered on solutions as a ninja in meditation!",
    "Excellent performance! Your math prowess is as renowned as a legendary ninja's feats!",
    "Fantastic work! You're as quick with answers as a ninja vanishing into the night!",
    "Remarkable job! Your calculations are as flawless as a ninja's execution!",
    "Outstanding performance! You're as dedicated to math as a ninja to their clan!",
    "Phenomenal work! Your mastery of math concepts is as complete as a ninja's training!",
    "Incredible job! Your math skills are as intimidating as a ninja's presence!",
    "Marvelous performance! You're as resourceful with numbers as a ninja on a secret mission!",
    "Terrific work! You're as proficient in arithmetic as a ninja with their weapons!",
    "Spectacular job! Your problem-solving is as impressive as a ninja's infiltration skills!",
    "Brilliant performance! You're as prepared for math challenges as a ninja for any scenario!",
    "Amazing work! Your math abilities are as comprehensive as a ninja's arsenal!",
    "Stellar job! You're as poised with calculations as a ninja facing adversity!",
    "Magnificent performance! You're as agile in problem-solving as a ninja evading capture!",
    "Awesome work! Your math skills are as revered as a ninja clan's ancient techniques!",
    "Superb job! You're as zeroed in on solutions as a ninja on their mark!",
    "Excellent performance! Your math prowess is as legendary as the tales of great ninjas!"
  ],
  "encouragement": [
    "Close, but not quite there. Keep practicing!",
    "Don't worry, even ninjas make mistakes sometimes.",
    "Nice try! Remember, practice makes perfect.",
    "Almost got it! Keep sharpening your skills.",
    "Not quite right, but you're getting closer!",
    "Keep going! Every attempt makes you stronger.",
    "You'll get it next time! Stay focused.",
    "Don't give up! You're improving with each try.",
    "It's okay to make mistakes. That's how we learn!",
    "Keep your chin up! You're making progress.",
    "Good effort! Let's try again, young ninja.",
    "Nearly there! Your ninja skills are growing.",
    "Not quite, but you're on the right path!",
    "Keep practicing, and you'll be a math ninja in no time!",
    "That was close! Your ninja reflexes are improving.",
    "Nice attempt! Every try brings you closer to mastery.",
    "You're getting better! Keep up the ninja spirit!",
    "Almost correct! Your math skills are sharpening.",
    "Good try! Remember, even ninja masters started as beginners.",
    "Keep at it! Your determination is admirable.",
    "Not quite right, but your effort is commendable!",
    "You're making progress! Keep training those math muscles.",
    "Close call! Your ninja instincts are developing.",
    "Nice effort! Every mistake is a step towards success.",
    "Keep pushing! Your math skills are growing stronger.",
    "Almost there! Your ninja focus is improving.",
    "Good attempt! Remember, practice is the key to mastery.",
    "Not quite, but you're on the path to becoming a math ninja!",
    "Keep trying! Your perseverance is truly ninja-like.",
    "Nice effort! Your math skills are evolving.",
    "Close one! Keep honing your ninja calculation skills.",
    "Good try! Every attempt brings you closer to ninja-level math.",
    "Not quite right, but your ninja spirit is strong!",
    "Keep going! Your math journey is just beginning.",
    "Almost got it! Your ninja instincts are sharpening.",
    "Nice attempt! Remember, even math ninjas start small.",
    "Keep at it! Your dedication is truly impressive.",
    "Not correct, but your effort is ninja-worthy!",
    "Good try! Your math skills are growing with each attempt.",
    "Close call! Your ninja-like focus is improving.",
    "Nice effort! Every mistake is a lesson in disguise.",
    "Keep pushing! You're on your way to becoming a math ninja.",
    "Almost there! Your calculation skills are getting sharper.",
    "Good attempt! Remember, patience is a ninja virtue.",
    "Not quite, but you're making ninja-like progress!",
    "Keep trying! Your math muscles are getting stronger.",
    "Nice effort! Your ninja determination is admirable.",
    "Close one! Keep practicing your ninja math moves.",
    "Good try! Every attempt brings you closer to math mastery.",
    "Not quite right, but your ninja spirit is unbreakable!",
    "Keep going! Your journey to become a math ninja continues.",
    "Almost got it! Your problem-solving skills are growing.",
    "Nice attempt! Remember, even ninja masters make mistakes.",
    "Keep at it! Your dedication is truly ninja-like.",
    "Not correct, but your effort deserves a ninja bow!",
    "Good try! Your math abilities are expanding like a ninja's arsenal.",
    "Close call! Your focus is becoming as sharp as a ninja's blade.",
    "Nice effort! Every error is a step towards ninja-level math skills.",
    "Keep pushing! You're on the path to mathematical enlightenment.",
    "Almost there! Your ninja-like precision is improving.",
    "Good attempt! Remember, persistence is the way of the ninja.",
    "Not quite, but you're making strides like a ninja in training!",
    "Keep trying! Your math prowess is growing stronger each day.",
    "Nice effort! Your determination would make any sensei proud.",
    "Close one! Keep refining your ninja calculation techniques.",
    "Good try! Every attempt adds to your ninja math wisdom.",
    "Not quite right, but your ninja spirit remains undefeated!",
    "Keep going! Your journey in the way of math-fu continues.",
    "Almost got it! Your problem-solving instincts are sharpening.",
    "Nice attempt! Remember, even the greatest ninjas started small.",
    "Keep at it! Your dedication to math is truly honorable.",
    "Not correct, but your effort shows the heart of a true ninja!",
    "Good try! Your math skills are blossoming like a ninja's abilities.",
    "Close call! Your concentration is becoming ninja-like.",
    "Nice effort! Every mistake is a hidden lesson for a math ninja.",
    "Keep pushing! You're on your way to becoming a grandmaster of math.",
    "Almost there! Your precision in calculations is improving.",
    "Good attempt! Remember, the path of the math ninja is long but rewarding.",
    "Not quite, but you're advancing like a determined young ninja!",
    "Keep trying! Your math strength grows with every challenge.",
    "Nice effort! Your perseverance is worthy of a true math ninja.",
    "Close one! Keep honing your ninja-like math instincts.",
    "Good try! Each attempt adds a new technique to your math arsenal.",
    "Not quite right, but your ninja spirit shines through!",
    "Keep going! Your path to becoming a math ninja is unfolding.",
    "Almost got it! Your ninja-like intuition for numbers is growing.",
    "Nice attempt! Remember, even math senseis were once beginners.",
    "Keep at it! Your commitment to math mastery is admirable.",
    "Not correct, but your effort shows the makings of a future math ninja!",
    "Good try! Your understanding of math is expanding like a ninja's knowledge.",
    "Close call! Your focus is becoming as steady as a ninja's stance.",
    "Nice effort! Every error is a stepping stone to math ninja greatness.",
    "Keep pushing! You're carving your own path in the world of mathematics.",
    "Almost there! Your ability to tackle math problems is growing stronger.",
    "Good attempt! Remember, the way of the math ninja is filled with challenges.",
    "Not quite, but you're progressing like a true disciple of mathematics!",
    "Keep trying! Your math skills are sharpening with each attempt.",
    "Nice effort! Your determination would impress even the wisest of senseis.",
    "Close one! Keep practicing your ninja-like mathematical techniques.",
    "Good try! Every attempt brings you closer to unlocking your full potential.",
    "Not quite right, but your unwavering spirit is that of a true math ninja!",
    "Keep going! Your journey to math ninja mastery is a noble quest."
  ]
}
